Revit 2027 API
BuiltInFailures.JoinElementsFailures.CannotJoinElementsError Property
 Can't keep elements joined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotJoinElementsError { get; }
Public Shared ReadOnly Property CannotJoinElementsError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotJoinElementsError {
	FailureDefinitionId^ get ();
}
static member CannotJoinElementsError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace